// 1. Створити масив з 10 чисел (можна використовувати Math.random Та Math.floor). Скласти результат цих чисел в змінній result.

let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
let result = 1+2+3+4+5+6+7+8+9+10;
console.log(result)

// 2. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр

// let book = {
//     name: `Harry Potter`,
//     numberOfPages: `345`,
//     genre: `fantasy`
// }
//     console.log(book)


// 3. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр, автори

// let book = {
//     name: `Harry Potter`,
//     numberOfPage: `345`,
//     genre: `fantacy`,
//     autors: `J.K.Rowling`
// }

// 4. Створити маис об'єктів book з наступними полями  - назва, кількість сторінок, жанр, автори. Вивести кожну книгу як окремий об'єкт

// let book = [{name: `Harry Potter`, numberOfPage: `345`, genre: `fantacy`, autors: `J.K.Rowling`}, {
//     name: `Iron Man`,
//     numberOfPage: `266`,
//     genre: `fantacy`,
//     autors: `Marvel`
// }]
//
// console.log(book[0])

// 5. Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
// Значення площі зберігати в змінній s.

// let wid = 10;
// let hei = 23;
// let s = wid * hei;
// console.log(s)

// 6. Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 4м (dC),
// результат помістіть у змінну v.

// let r = 2;
// let h = 10;
// let v = 3.14 * (r**2) * h

// 7. У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4).
// Знайдіть гіпотенузу k за теоремою Піфагора (потрібно використовувати функцію Math.pow (число, ступінь) або оператор зведення в ступінь **).

// let a = 3;
// let b = 4;
// let k = Math.sqrt(a**2 + b**2)
// console.log(k)
