// Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// if (friends.length >= 3) {
//     console.log(`Big object`)
// }
// else {
//     console.log(`small object`)
// }

// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
// let a = 7;
// let b = 5;
// let c = 9;
// if (a>b & a<c) {
//     console.log(`this number a`)
// }
// else if (b>a & b<c) {
//     console.log(`this number b`)
// }
// else if (c>a & c<b) {
//     console.log(`this number c`)
// }

// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
// let result = (a + b < 4) ? `small` : `Big`
// console.log(result)
//
// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
// let a = 0
// let number = (a>0) ? `Positiv` :
//     (a<0) ? `Negative` :
//         `this Null`;
// console.log(number)